package ru.mephi.java.ch02.task12;
/*
Создайте исходный файл HelloW orld. java, где класс HelloW orld объявляется в пакете chOl.secOl.
Разметите его в каком-нибудь каталоге, но только не в подкаталоге chOl/secOl.
Выполните из этого каталога команду javac HelloWorld.java.
Получите ли вы в итоге файл класса и где именно?
Затем выполните команду java HelloWorld. Что при этом произойдет и почему?
(Подсказка: выполните команду javap HelloWorld и проанализируйте полуjaченное предупреждающее сообщение.) И наконец, попробуйте выполнить ко­ мандуjavac -d . HelloWorld.java. Почемутакойспособлучше?
 */
public class Test {

}
